In [1]:
getcwd()

NameError: name 'getcwd' is not defined

In [2]:
import os

In [3]:
os.getcwd()

'C:\\Users\\n0176726'

In [4]:
import pandas as pd

In [8]:
ufo = pd.read_csv('ufo.csv')
ufo.head

FileNotFoundError: [Errno 2] File b'ufo.csv' does not exist: b'ufo.csv'

In [9]:
cls

In [1]:
ufo = pd.read_csv('ufo.csv')

NameError: name 'pd' is not defined

In [11]:
ufo.head

<bound method NDFrame.head of                        City Colors Reported Shape Reported State  \
0                    Ithaca             NaN       TRIANGLE    NY
1               Willingboro             NaN          OTHER    NJ
2                   Holyoke             NaN           OVAL    CO
3                   Abilene             NaN           DISK    KS
4      New York Worlds Fair             NaN          LIGHT    NY
...                     ...             ...            ...   ...
18236            Grant Park             NaN       TRIANGLE    IL
18237           Spirit Lake             NaN           DISK    IA
18238           Eagle River             NaN            NaN    WI
18239           Eagle River             RED          LIGHT    WI
18240                  Ybor             NaN           OVAL    FL

                   Time
0        6/1/1930 22:00
1       6/30/1930 20:00
2       2/15/1931 14:00
3        6/1/1931 13:00
4       4/18/1933 19:00
...                 ...
18236  12/31/2000 23:00
18237  12/31/2000 23:00
18238  12/31/2000 23:45
18239  12/31/2000 23:45
18240  12/31/2000 23:59

[18241 rows x 5 columns]>

In [12]:
df.index

NameError: name 'df' is not defined

In [13]:
ufo.index

RangeIndex(start=0, stop=18241, step=1)

In [14]:
df = ufo

In [15]:
ufo.index

RangeIndex(start=0, stop=18241, step=1)

In [16]:
df

,City,Colors Reported,Shape Reported,State,Time
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00
3,Abilene,NaN,DISK,KS,6/1/1931 13:00
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00
...,...,...,...,...,...
18236,Grant Park,NaN,TRIANGLE,IL,12/31/2000 23:00
18237,Spirit Lake,NaN,DISK,IA,12/31/2000 23:00
18238,Eagle River,NaN,NaN,WI,12/31/2000 23:45
18239,Eagle River,RED,LIGHT,WI,12/31/2000 23:45
18240,Ybor,NaN,OVAL,FL,12/31/2000 23:59

In [17]:
df.index

RangeIndex(start=0, stop=18241, step=1)

In [18]:
df.dtypes

City               object
Colors Reported    object
Shape Reported     object
State              object
Time               object
dtype: object

In [19]:
df.T

,0,1,2,3,4,5,6,7,8,9,...,18231,18232,18233,18234,18235,18236,18237,18238,18239,18240
City,Ithaca,Willingboro,Holyoke,Abilene,New York Worlds Fair,Valley City,Crater Lake,Alma,Eklutna,Hubbard,...,Pismo Beach,Lodi,Anchorage,Capitola,Fountain Hills,Grant Park,Spirit Lake,Eagle River,Eagle River,Ybor
Colors Reported,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,RED,NaN,NaN,NaN,NaN,NaN,RED,NaN
Shape Reported,TRIANGLE,OTHER,OVAL,DISK,LIGHT,DISK,CIRCLE,DISK,CIGAR,CYLINDER,...,OVAL,NaN,VARIOUS,TRIANGLE,NaN,TRIANGLE,DISK,NaN,LIGHT,OVAL
State,NY,NJ,CO,KS,NY,ND,CA,MI,AK,OR,...,CA,WI,AK,CA,AZ,IL,IA,WI,WI,FL
Time,6/1/1930 22:00,6/30/1930 20:00,2/15/1931 14:00,6/1/1931 13:00,4/18/1933 19:00,9/15/1934 15:30,6/15/1935 0:00,7/15/1936 0:00,10/15/1936 17:00,6/15/1937 0:00,...,12/31/2000 20:00,12/31/2000 20:30,12/31/2000 21:00,12/31/2000 22:00,12/31/2000 23:00,12/31/2000 23:00,12/31/2000 23:00,12/31/2000 23:45,12/31/2000 23:45,12/31/2000 23:59

In [20]:
fd.['A']

SyntaxError: invalid syntax (<ipython-input-20-8caf3a04e836>, line 1)

In [21]:
df.['A']

SyntaxError: invalid syntax (<ipython-input-21-d76f46e5b697>, line 1)

In [22]:
df.['3']

SyntaxError: invalid syntax (<ipython-input-22-dc751579f7e3>, line 1)

In [23]:
df['3']

KeyError: '3'

In [24]:
df.3

SyntaxError: invalid syntax (<ipython-input-24-c52133135320>, line 1)

In [25]:
ufo.3

SyntaxError: invalid syntax (<ipython-input-25-100faf055d85>, line 1)

In [26]:
ufo.{'4'}

SyntaxError: invalid syntax (<ipython-input-26-fc9921034a0b>, line 1)

In [27]:
df.discribe

AttributeError: 'DataFrame' object has no attribute 'discribe'

In [28]:
ufo.discribe

AttributeError: 'DataFrame' object has no attribute 'discribe'

In [29]:
importnumpy as np

SyntaxError: invalid syntax (<ipython-input-29-2ee60ea3355a>, line 1)

In [30]:
import numpy as np

In [31]:
ufo.discribe

AttributeError: 'DataFrame' object has no attribute 'discribe'

In [32]:
df.discribe

AttributeError: 'DataFrame' object has no attribute 'discribe'

In [33]:
df.sort_values(by='B')

KeyError: 'B'

In [35]:
df.sort_values(by='4')

KeyError: '4'

In [36]:
ufo

,City,Colors Reported,Shape Reported,State,Time
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00
3,Abilene,NaN,DISK,KS,6/1/1931 13:00
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00
...,...,...,...,...,...
18236,Grant Park,NaN,TRIANGLE,IL,12/31/2000 23:00
18237,Spirit Lake,NaN,DISK,IA,12/31/2000 23:00
18238,Eagle River,NaN,NaN,WI,12/31/2000 23:45
18239,Eagle River,RED,LIGHT,WI,12/31/2000 23:45
18240,Ybor,NaN,OVAL,FL,12/31/2000 23:59

In [37]:
%quickref

In [38]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [39]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [40]:
dates = pd.date_range('20130101', periods=6)

In [41]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [42]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

In [43]:
df

                   A         B         C         D
2013-01-01  0.925127 -1.389596  0.215111  1.904635
2013-01-02  0.514489 -0.266862  0.543683  1.006077
2013-01-03  1.403168  0.829125 -0.034857  1.835687
2013-01-04 -0.031830  1.969764  1.542249  0.682933
2013-01-05  1.003089 -0.187680 -0.507471 -1.938958
2013-01-06  0.113833  2.293376 -1.649660 -0.003327

In [44]:
df2 = pd.DataFrame({'A': 1.,
   ...:                     'B': pd.Timestamp('20130102'),
   ...:                     'C': pd.Series(1, index=list(range(4)), dtype='float32'),
   ...:                     'D': np.array([3] * 4, dtype='int32'),
   ...:                     'E': pd.Categorical(["test", "train", "test", "train"]),
   ...:                     'F': 'foo'})

In [45]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [47]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [48]:
df2.<TAB>  # noqa: E225, E999

SyntaxError: invalid syntax (<ipython-input-48-2e62111f8e28>, line 1)

In [49]:
df3 Links

SyntaxError: invalid syntax (<ipython-input-49-b82b5df53122>, line 1)

In [50]:
df.head

<bound method NDFrame.head of                    A         B         C         D
2013-01-01  0.925127 -1.389596  0.215111  1.904635
2013-01-02  0.514489 -0.266862  0.543683  1.006077
2013-01-03  1.403168  0.829125 -0.034857  1.835687
2013-01-04 -0.031830  1.969764  1.542249  0.682933
2013-01-05  1.003089 -0.187680 -0.507471 -1.938958
2013-01-06  0.113833  2.293376 -1.649660 -0.003327>

In [51]:
df.tail

<bound method NDFrame.tail of                    A         B         C         D
2013-01-01  0.925127 -1.389596  0.215111  1.904635
2013-01-02  0.514489 -0.266862  0.543683  1.006077
2013-01-03  1.403168  0.829125 -0.034857  1.835687
2013-01-04 -0.031830  1.969764  1.542249  0.682933
2013-01-05  1.003089 -0.187680 -0.507471 -1.938958
2013-01-06  0.113833  2.293376 -1.649660 -0.003327>

In [52]:
df.to_numpy()

array([[ 0.92512686, -1.38959567,  0.21511086,  1.90463537],
       [ 0.51448943, -0.26686242,  0.54368254,  1.00607701],
       [ 1.40316835,  0.82912486, -0.03485655,  1.83568671],
       [-0.03183024,  1.96976357,  1.54224882,  0.6829334 ],
       [ 1.00308931, -0.18767971, -0.50747093, -1.93895761],
       [ 0.11383257,  2.29337646, -1.64966024, -0.00332662]])

In [53]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.654646  0.541355  0.018176  0.581175
std    0.554659  1.421690  1.067570  1.428912
min   -0.031830 -1.389596 -1.649660 -1.938958
25%    0.213997 -0.247067 -0.389317  0.168238
50%    0.719808  0.320723  0.090127  0.844505
75%    0.983599  1.684604  0.461540  1.628284
max    1.403168  2.293376  1.542249  1.904635

In [54]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  1.904635  0.215111 -1.389596  0.925127
2013-01-02  1.006077  0.543683 -0.266862  0.514489
2013-01-03  1.835687 -0.034857  0.829125  1.403168
2013-01-04  0.682933  1.542249  1.969764 -0.031830
2013-01-05 -1.938958 -0.507471 -0.187680  1.003089
2013-01-06 -0.003327 -1.649660  2.293376  0.113833

In [55]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-01  0.925127 -1.389596  0.215111  1.904635
2013-01-02  0.514489 -0.266862  0.543683  1.006077
2013-01-05  1.003089 -0.187680 -0.507471 -1.938958
2013-01-03  1.403168  0.829125 -0.034857  1.835687
2013-01-04 -0.031830  1.969764  1.542249  0.682933
2013-01-06  0.113833  2.293376 -1.649660 -0.003327

In [56]:
df['A']

2013-01-01    0.925127
2013-01-02    0.514489
2013-01-03    1.403168
2013-01-04   -0.031830
2013-01-05    1.003089
2013-01-06    0.113833
Freq: D, Name: A, dtype: float64

In [57]:
df[0:3]

                   A         B         C         D
2013-01-01  0.925127 -1.389596  0.215111  1.904635
2013-01-02  0.514489 -0.266862  0.543683  1.006077
2013-01-03  1.403168  0.829125 -0.034857  1.835687

In [58]:
df.loc[dates[0]]

A    0.925127
B   -1.389596
C    0.215111
D    1.904635
Name: 2013-01-01 00:00:00, dtype: float64

In [59]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01  0.925127 -1.389596
2013-01-02  0.514489 -0.266862
2013-01-03  1.403168  0.829125
2013-01-04 -0.031830  1.969764
2013-01-05  1.003089 -0.187680
2013-01-06  0.113833  2.293376

In [60]:
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02  0.514489 -0.266862
2013-01-03  1.403168  0.829125
2013-01-04 -0.031830  1.969764

In [61]:
df.loc['20130102', ['A', 'B']]

A    0.514489
B   -0.266862
Name: 2013-01-02 00:00:00, dtype: float64

In [62]:
df.loc['20130102', ['A', 'B']]

A    0.514489
B   -0.266862
Name: 2013-01-02 00:00:00, dtype: float64

In [63]:
df.loc[dates[0], 'A']

0.925126856153183

In [64]:
df.at[dates[0], 'A']

0.925126856153183

In [65]:
df.iloc[3]

A   -0.031830
B    1.969764
C    1.542249
D    0.682933
Name: 2013-01-04 00:00:00, dtype: float64

In [66]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.031830  1.969764
2013-01-05  1.003089 -0.187680

In [67]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02  0.514489  0.543683
2013-01-03  1.403168 -0.034857
2013-01-05  1.003089 -0.507471

In [68]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  0.925127 -1.389596  0.215111  1.904635
2013-01-02  0.514489 -0.266862  0.543683  1.006077
2013-01-03  1.403168  0.829125 -0.034857  1.835687
2013-01-05  1.003089 -0.187680 -0.507471 -1.938958
2013-01-06  0.113833  2.293376 -1.649660 -0.003327

In [69]:
df[df > 0]

                   A         B         C         D
2013-01-01  0.925127       NaN  0.215111  1.904635
2013-01-02  0.514489       NaN  0.543683  1.006077
2013-01-03  1.403168  0.829125       NaN  1.835687
2013-01-04       NaN  1.969764  1.542249  0.682933
2013-01-05  1.003089       NaN       NaN       NaN
2013-01-06  0.113833  2.293376       NaN       NaN

In [70]:
df2 = df.copy()

In [71]:
df2

                   A         B         C         D
2013-01-01  0.925127 -1.389596  0.215111  1.904635
2013-01-02  0.514489 -0.266862  0.543683  1.006077
2013-01-03  1.403168  0.829125 -0.034857  1.835687
2013-01-04 -0.031830  1.969764  1.542249  0.682933
2013-01-05  1.003089 -0.187680 -0.507471 -1.938958
2013-01-06  0.113833  2.293376 -1.649660 -0.003327

In [72]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20130102', periods=6))

In [73]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [74]:
df.at[dates[0], 'A'] = 0

In [75]:
df

                   A         B         C         D
2013-01-01  0.000000 -1.389596  0.215111  1.904635
2013-01-02  0.514489 -0.266862  0.543683  1.006077
2013-01-03  1.403168  0.829125 -0.034857  1.835687
2013-01-04 -0.031830  1.969764  1.542249  0.682933
2013-01-05  1.003089 -0.187680 -0.507471 -1.938958
2013-01-06  0.113833  2.293376 -1.649660 -0.003327

In [76]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [77]:
df1.loc[dates[0]:dates[1], 'E'] = 1

In [78]:
df1

                   A         B         C         D    E
2013-01-01  0.000000 -1.389596  0.215111  1.904635  1.0
2013-01-02  0.514489 -0.266862  0.543683  1.006077  1.0
2013-01-03  1.403168  0.829125 -0.034857  1.835687  NaN
2013-01-04 -0.031830  1.969764  1.542249  0.682933  NaN

In [79]:
df1.dropna(how='any')

                   A         B         C         D    E
2013-01-01  0.000000 -1.389596  0.215111  1.904635  1.0
2013-01-02  0.514489 -0.266862  0.543683  1.006077  1.0

In [80]:
df1.fillna(value=5)

                   A         B         C         D    E
2013-01-01  0.000000 -1.389596  0.215111  1.904635  1.0
2013-01-02  0.514489 -0.266862  0.543683  1.006077  1.0
2013-01-03  1.403168  0.829125 -0.034857  1.835687  5.0
2013-01-04 -0.031830  1.969764  1.542249  0.682933  5.0

In [81]:
pd.isna(df1)

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True

In [82]:
df.mean()

A    0.500458
B    0.541355
C    0.018176
D    0.581175
dtype: float64

In [83]:
df.mean(1)

2013-01-01    0.182538
2013-01-02    0.449347
2013-01-03    1.008281
2013-01-04    1.040779
2013-01-05   -0.407755
2013-01-06    0.188556
Freq: D, dtype: float64

In [84]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)

In [85]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [86]:
df.sub(s, axis='index')

                   A         B         C         D
2013-01-01       NaN       NaN       NaN       NaN
2013-01-02       NaN       NaN       NaN       NaN
2013-01-03  0.403168 -0.170875 -1.034857  0.835687
2013-01-04 -3.031830 -1.030236 -1.457751 -2.317067
2013-01-05 -3.996911 -5.187680 -5.507471 -6.938958
2013-01-06       NaN       NaN       NaN       NaN

In [87]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01  0.000000 -1.389596  0.215111  1.904635
2013-01-02  0.514489 -1.656458  0.758793  2.910712
2013-01-03  1.917658 -0.827333  0.723937  4.746399
2013-01-04  1.885828  1.142430  2.266186  5.429332
2013-01-05  2.888917  0.954751  1.758715  3.490375
2013-01-06  3.002749  3.248127  0.109054  3.487048

In [88]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [89]:
s

0    5
1    5
2    0
3    3
4    5
5    1
6    3
7    5
8    6
9    4
dtype: int32

In [90]:
s.value_counts()

5    4
3    2
6    1
4    1
1    1
0    1
dtype: int64

In [91]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [92]:
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [93]:
df = pd.DataFrame(np.random.randn(10, 4))

In [94]:
fd

NameError: name 'fd' is not defined

In [95]:
df

          0         1         2         3
0 -1.317335  0.245384 -2.124610  0.448368
1 -0.320462 -0.165617 -0.764714 -0.520322
2 -0.557944 -0.603785  1.266843 -0.505846
3 -0.024644 -0.986384 -0.726428  1.764075
4 -0.000135 -0.113163  0.860897 -0.094081
5  0.747665 -0.300899  0.194963 -1.926131
6 -0.179425  2.178238 -0.632561  1.123216
7 -0.054777  1.659452  1.000411 -0.161988
8 -0.623498 -1.727600 -0.792723 -0.808870
9  2.082507 -0.660625  1.428891 -2.039170

In [96]:
pieces = [df[:3], df[3:7], df[7:]]

In [97]:
pieces

[          0         1         2         3
 0 -1.317335  0.245384 -2.124610  0.448368
 1 -0.320462 -0.165617 -0.764714 -0.520322
 2 -0.557944 -0.603785  1.266843 -0.505846,
           0         1         2         3
 3 -0.024644 -0.986384 -0.726428  1.764075
 4 -0.000135 -0.113163  0.860897 -0.094081
 5  0.747665 -0.300899  0.194963 -1.926131
 6 -0.179425  2.178238 -0.632561  1.123216,
           0         1         2         3
 7 -0.054777  1.659452  1.000411 -0.161988
 8 -0.623498 -1.727600 -0.792723 -0.808870
 9  2.082507 -0.660625  1.428891 -2.039170]

In [98]:
pd.concat(pieces)

          0         1         2         3
0 -1.317335  0.245384 -2.124610  0.448368
1 -0.320462 -0.165617 -0.764714 -0.520322
2 -0.557944 -0.603785  1.266843 -0.505846
3 -0.024644 -0.986384 -0.726428  1.764075
4 -0.000135 -0.113163  0.860897 -0.094081
5  0.747665 -0.300899  0.194963 -1.926131
6 -0.179425  2.178238 -0.632561  1.123216
7 -0.054777  1.659452  1.000411 -0.161988
8 -0.623498 -1.727600 -0.792723 -0.808870
9  2.082507 -0.660625  1.428891 -2.039170